OpenFOAM/WFD_OpenFOAM/cases/overnight_20260527_224229_bca724/pitch_8p5_wider_chord/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// OpenFOAM 13 supersedes surfaceFeatureExtract with surfaceFeatures.
// This compatibility dictionary records the equivalent legacy settings;
// the runnable v13 dictionary is system/surfaceFeaturesDict.

extractionMethod     extractFromSurface;

extractFromSurfaceCoeffs
{
    includedAngle    150;
    geometricTestOnly no;
}

subsetFeatures
{
    nonManifoldEdges yes;
    openEdges        yes;
}

trimFeatures
{
    minElem          5;
    minLen           0;
}

writeObj             yes;

// ************************************************************************* //
